app/controllers/board_controller.rb

SELECT * FROM "posts" WHERE ("posts"."post_id" IS NULL) ORDER BY created_at DESC, header LIMIT 100
---
  def index
    @posts = Post.find(:all, :order => "created_at DESC, header", :conditions => { :post_id => nil }, :limit => 100)

SELECT * FROM "posts" WHERE ("posts".post_id = 26) ORDER BY created_at DESC, header
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "hosts" ("name", "whois", "updated_at", "ip", "created_at") VALUES(NULL, NULL, '2009-08-22 22:01:34', '127.0.0.1', '2009-08-22 22:01:34')
INSERT INTO "posts" ("updated_at", "body", "post_subject_id", "has_pics", "post_id", "header", "host_id", "times_viewed", "user_id", "unregistered_user_name", "has_urls", "path", "created_at") VALUES('2009-08-22 17:46:40', 'фыва', NULL, NULL, NULL, 'выа', NULL, 0, 0, NULL, NULL, NULL, '2009-08-22 17:46:40')
SELECT * FROM "hosts" WHERE ("hosts"."ip" = '127.0.0.1') LIMIT 1
---
  def create
    @post = Post.new(params[:post])
    @post.host = Host.find_or_create_by_ip(:ip => request.remote_ip)

DELETE FROM "posts" WHERE ("id" IN ('5'))
---
  def destroy
    Post.delete(params[:id])